analytic-signal.preview-html
anthropic.claude-code
cweijan.epub-reader
dbaeumer.vscode-eslint
docker.docker
formulahendry.auto-rename-tag
github.codespaces
github.copilot-chat
github.remotehub
github.vscode-pull-request-github
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.vscode-typescript-next
ritwickdey.liveserver
streetsidesoftware.code-spell-checker
tomoki1207.pdf